Tekla Open API Reference for Tekla Structures 2025
AutoDrawingRule Constructor
 Creates a new AutoDrawing rule by using an existing rule file.
 Namespace: Tekla.Structures.Drawing.Automation
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AutoDrawingRule(
	string RuleFromFile
)
Public Sub New (
	RuleFromFile As String
)
Parameters
RuleFromFile
Type: System.String
The filename of the rule file.
See Also
Reference
AutoDrawingRule Class
Tekla.Structures.Drawing.Automation Namespace